// - Дано натуральное число n. Выведите все числа от 1 до n.

// function rec(i, n) {
//
//     console.log(i);
//     i++;
//     if (i > n) {
//         return;
//     }
//     rec(i, n);
// }
// let A=1;
// rec(A, 10);

// - Даны два целых числа A и В . Выведите все числа от A до B включительно, в порядке возрастания, если A < B, или в порядке убывания в противном случае.

// function rec(a, b) {
//     if (a < b) {
//         console.log(a);
//         a++;
//         if (a > b) {
//             return;
//         }
//
//         rec(a, b);
//     } else if (a >= b) {
//
//         console.log(a);
//         a--;
//
//
//         if (a <b) {
//             return;
//         }
//
//         rec(a, b);
//
//     }
// }
//
// rec(1, 9);
// console.log("")
// rec(12, 9);



// -   функція Приймає масив та число "i", та міняє місцями об`єкт який знаходиться в індексі "i" на "i+1"
//   EXAMPLE:
//   foo([9,8,0,4], 0) // ==> [ 8, 9, 0, 4 ]
//   foo([9,8,0,4], 1) // ==> [ 9 ,0, 8, 4 ]
//   foo([9,8,0,4], 2) // ==> [ 9, 8, 4, 0 ]



// let foo=(a,b)=> {
//
//
//     t = a[b];
//     a[b] = a[b + 1];
//     a[b + 1] = t;
//
//     console.log(a);
// }
// foo([9,8,0,4],0)
// foo([9,8,0,4],1)
// foo([9,8,0,4],2)


    // - Сворити функцію яка буде переносити елементи з значенням 0 у кінець маисву. Зберігаючи при цьому порядок не нульових значень.
// Двожина масиву від 2 до 100
// EXAMPLE:
// [1,0,6,0,3] => [1,6,3,0,0]
// [0,1,2,3,4] => [1,2,3,4,0]
// [0,0,1,0]   => [1,0,0,0]



// let foo =(arr)=> {
//     let c = 0;
//     for (let i = 0; i < arr.length; i++){
//         if(arr[i] !== 0){
//             arr[c++] = arr[i];
//
//         }
//
//     }
//
//     for (let i = c; i < arr.length; i++){
//         arr[i] = 0;
//
//     }
//     console.log(arr);
//     return arr;
// }
//
// foo([1,0,6,0,3]);
// foo([0,1,2,3,4]);
// foo([0,0,1,0]);
//
//
